<center><h1>第二章 pandas基础</h1></center>

In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.1.0'

## 一、文件的读取和写入
### 1.文件读取

`pandas`可以读取的文件格式有很多，包括csv,excel,txt

In [4]:
df_csv = pd.read_csv('data/my_csv.csv')
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [5]:
df_txt = pd.read_table('data/my_table.txt')
df_txt

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

In [6]:
df_excel = pd.read_excel('data/my_excel.xlsx')
df_excel

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

一些常用的公共参数，`header=None`表示第一行不作列名，`index_col`表示把某一列或几列
作为索引，usecols表示读取列的集合，默认读取所有的列，`parse_dates`表示需要转化为时间
的列，nrows表示读取的数据行数

In [7]:
pd.read_table('data/my_table.txt',header=None)

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

In [8]:
pd.read_csv('data/my_csv.csv',index_col=['col1','col2'])

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5
5    d      3.2   lemon  2020/1/7

In [9]:
pd.read_table('data/my_table.txt',usecols=['col1','col2'])

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

In [10]:
pd.read_csv('data/my_csv.csv',parse_dates=['col5'])

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05
3     5    d   3.2   lemon 2020-01-07

In [11]:
pd.read_excel('data/my_excel.xlsx',nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

read_table有一个分割参数sep,可以自定义分割符号

In [14]:
pd.read_table('data/my_table_special_sep.txt')

                   col1 |||| col2
0       TS |||| This is an apple.
1       GQ   |||| My name is Bob.
2              WT |||| Well done!
3         PT |||| May I help you?

In [17]:
pd.read_table('data/my_table_special_sep.txt',sep='\|\|\|\|',engine='python')

   col1                 col2
0    TS    This is an apple.
1  GQ        My name is Bob.
2    WT           Well done!
3    PT      May I help you?

### 2.数据写入

index设置为False,在保存的时候去除索引

In [18]:
df_csv.to_csv('data/my_csv_saved',index=False)
df_excel.to_excel('data/my_excel_saved.xlsx',index=False)

to_csv可以保存为txt文件，并且允许自定义分隔符，常用\t分割

In [19]:
df_txt.to_csv('data/my_txt_saved.txt',sep='\t',index=False)

使用`to_markdown`和`to_latx`函数可以把表格快速转换为markdown,latex语言

In [22]:
print(df_csv.to_markdown())

|    |   col1 | col2   |   col3 | col4   | col5     |
|---:|-------:|:-------|-------:|:-------|:---------|
|  0 |      2 | a      |    1.4 | apple  | 2020/1/1 |
|  1 |      3 | b      |    3.4 | banana | 2020/1/2 |
|  2 |      6 | c      |    2.5 | orange | 2020/1/5 |
|  3 |      5 | d      |    3.2 | lemon  | 2020/1/7 |

In [23]:
print(df_csv.to_latex())

\begin{tabular}{lrlrll}
\toprule
{} &  col1 & col2 &  col3 &    col4 &      col5 \\
\midrule
0 &     2 &    a &   1.4 &   apple &  2020/1/1 \\
1 &     3 &    b &   3.4 &  banana &  2020/1/2 \\
2 &     6 &    c &   2.5 &  orange &  2020/1/5 \\
3 &     5 &    d &   3.2 &   lemon &  2020/1/7 \\
\bottomrule
\end{tabular}

## 基本数据结构

两种基本的数据结构，一维`Series`和二维`DataFrame`

### 1.Series

Series一般由四部分组成，值`data`,索引`index`,存储类型`dtype`，序列的名字`name`。索引也可以指定它的名字，默认为空

In [2]:
import pandas as pd
import numpy as np

In [57]:
s = pd.Series(data=[100,'a',{'dict':5}],index=pd.Index(['id1',20,'third'],name='my_index'),name='my_name',dtype=object)
type(s.index)

pandas.core.indexes.base.Index

这些属性都可以通过 . 的方式来获取

In [9]:
s.dtype

dtype('O')

In [10]:
s.shape

(3,)

### 2.DataFrame

In [15]:
data=[[1,'a',1.2],[2,'b',2.2],[3,'c',3.2]]
df = pd.DataFrame(data=data,index=['row_%d'%i for i in range(3)],columns=['col_0','col_1','col_2'])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [16]:
df = pd.DataFrame(data = {'col_0':[1,2,3],'col_1':list('abc'),'col_2':[1.2,2.2,3.2]},
index=['row_%d'%i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [21]:
df['col_0'].index

Index(['row_0', 'row_1', 'row_2'], dtype='object')

In [18]:
type(df['col_1'])

pandas.core.series.Series

In [23]:
df.dtypes

col_0      int64
col_1     object
col_2    float64
dtype: object

In [26]:
df.T.index

Index(['col_0', 'col_1', 'col_2'], dtype='object')

## 三、常用基本函数

In [97]:
df = pd.read_csv('data/learn_pandas.csv')
type(df.columns)

pandas.core.indexes.base.Index

In [32]:
df = df[df.columns[:7]]#取前7列

### 1.汇总函数

`head`,`tail`分别返回表或序列的前n行和后n行，默认为5

In [34]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N

In [36]:
df.tail(2)

,School,Grade,Name,Gender,Height,Weight,Transfer
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

`info`,`describe`分别返回表中的信息概况和表中数值对应的主要统计量

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [39]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

### 2.特征统计函数

一些统计函数。sum,mean,median,var,std,max,min. `quantile`分位数 `count`非缺失值个数 `idmax`最大值对应的索引

In [47]:
df_demo = df[['Height','Weight']]
df_demo.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [51]:
df_demo.max()

Height    193.9
Weight     89.0
dtype: float64

In [52]:
df_demo.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [54]:
df_demo.idxmax()

Height    193
Weight      2
dtype: int64

上面的这些所有的函数，由于操作后返回的是标量，所以又称为聚合函数，它们有一个公共参数`axis`,默认为0代表逐列聚合，如果设置为1则表示逐行聚合

In [56]:
df_demo.mean(axis=1).head()

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

In [59]:
type(df_demo.columns)

pandas.core.indexes.base.Index

### 3.唯一值函数

对序列使用`unique`和`nunique`可以分别得到其唯一值组成的列表和唯一值的个数

In [61]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [63]:
df['School'].nunique()

4

`value_counts`可以得到唯一值和其对应出现的频数

In [64]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [69]:
df_demo = df[['Gender','Transfer','Name']]

In [70]:
df_demo['Name'].value_counts()

Yanli Zhang       3
Xiaoqiang Qin     3
Qiang Sun         3
Chunpeng Lv       2
Feng Yang         2
                 ..
Quan Chu          1
Chunmei Shi       1
Xiaoquan Zhang    1
Qiang Lv          1
Li Wu             1
Name: Name, Length: 170, dtype: int64

如果想要观察多个列组合的唯一值，可以使用`drop_duplicates`.其中的关键参数是`keep`，默认`first`表示每个组合保留第一次出现的所在行，`last`表示保留最后一次出现的所在行，
`False`表示把所有重复组合所在的行剔除。

In [76]:
df_demo = df[['Gender','Transfer','Name']]
df_demo.drop_duplicates(['Gender','Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [78]:
df_demo.drop_duplicates(['Gender','Transfer'],keep='last')

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [87]:
df_demo.drop_duplicates(['Name', 'Gender'],keep=False).head()#保留只出现一次的性别和姓名的组合

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
4    Male        N     Gaojuan You
5  Female        N     Xiaoli Qian

In [88]:
df['School'].drop_duplicates()

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object

In [90]:
df_demo.duplicated(['Gender','Transfer'])

0      False
1      False
2       True
3       True
4       True
       ...
195     True
196     True
197     True
198     True
199     True
Length: 200, dtype: bool

此外，`duplicated`和`drop_d
uplicates`的功能类似，但前者返回了是否为唯一值的布尔列表，其`keep`参数与后者一致。其返回的序列，把重复元素设为`True`，否则为`False`。 `drop_duplicates`等价于把`duplicated`为`True`的对应行剔除。

In [91]:
df['School'].duplicated().head()

0    False
1    False
2     True
3    False
4     True
Name: School, dtype: bool

### 4.替换函数

一般而言，替换操作是针对某一个列进行的

In [98]:
df['Gender'].replace({'Female':0,'Male':1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [99]:
df['Gender'].replace(['Female', 'Male'], [0, 1]).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

另外，`replace`还有一种特殊的方向替换，指定`method`参数为`ffill`则为用前面一个最近的未被替换的值进行替换，`bfill`则使用后面最近的未被替换的值进行替换。从下面的例子可以看到，它们的结果是不同的：

In [100]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a'])
s.replace([1, 2], method='ffill')

0    a
1    a
2    b
3    b
4    b
5    b
6    a
dtype: object

In [101]:
s.replace([1, 2], method='bfill')

0    a
1    b
2    b
3    a
4    a
5    a
6    a
dtype: object

#### 【END】

逻辑替换包括了`where`和`mask`，这两个函数是完全对称的：`where`函数在传入条件为`False`的对应行进行替换，而`mask`在传入条件为`True`的对应行进行替换，当不指定替换值时，替换为缺失值。

In [102]:
s = pd.Series([-1, 1.2345, 100, -50])
s.where(s<0)

0    -1.0
1     NaN
2     NaN
3   -50.0
dtype: float64

In [103]:
s<0

0     True
1    False
2    False
3     True
dtype: bool

In [104]:
s.mask(s<0)

0         NaN
1      1.2345
2    100.0000
3         NaN
dtype: float64

需要注意的是，传入的条件只需是与被调用的`Series`索引一致的布尔序列即可：

In [105]:
s_condition= pd.Series([True,False,False,True],index=s.index)
s.mask(s_condition, -50)

0    -50.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64


数值替换包含了`round, abs, clip`方法，它们分别表示取小数位数、取绝对值和截断：

In [106]:
s = pd.Series([-1, 1.2345, 100, -50])
s.round(2)

0     -1.00
1      1.23
2    100.00
3    -50.00
dtype: float64

In [107]:
s.abs()

0      1.0000
1      1.2345
2    100.0000
3     50.0000
dtype: float64

In [108]:
s.clip(0, 2) # 前两个数分别表示上下截断边界

0    0.0000
1    1.2345
2    2.0000
3    0.0000
dtype: float64